// 猫眼
const citys = [
    {
        A: [
            '阿拉善盟', '鞍山', '安庆', '安阳', '阿坝', '安顺', '安康', '阿勒泰', '阿克苏', '安吉', '安丘', '安岳', '安平',
            '安宁', '安溪', '安化', '阿勒泰市', '安福'
        ]
    },
    {
        B: [
            '北京', '保定', '蚌埠', '包头', '本溪', '巴彦淖尔', '白城', '白山', '亳州', '滨州', '巴中', '北海', '百色', '毕节',
            '保山', '宝鸡', '白银', '巴州', '博尔塔拉', '滨海', '宝应', '北流', '博爱', '北碚', '宝丰', '泌阳', '博兴', '博山',
            '璧山', '彬县', '宾阳', '博白县', '博罗县', '北镇市', '泊头市', '北安市', '巴彦县'
        ]
    },
    {
        C: [
            '重庆', '成都', '长沙', '常州', '长春', '沧州', '承德', '赤峰', '长治', '朝阳', '池州', '巢湖', '滁州', '潮州', '郴州',
            '常德', '崇左', '楚雄', '昌吉', '从化', '常熟', '长乐', '长兴', '慈溪', '昌邑', '长葛', '苍南', '承德县', '赤壁', '崇州',
            '淳安', '曹妃甸', '昌乐', '磁县', '昌黎', '岑溪', '成安', '长垣', '曹县', '城阳', '茌平', '长汀', '城固', '赤水', '常山',
            '长寿', '潮安', '潮阳', '澄海', '长丰县', '茶陵', '常宁市', '苍溪县', '慈利', '长清区', '崇明区', '成武县', '澄江县'
        ]
    },
    {
        D: [
            '大连', '东莞', '大庆', '大同', '丹东', '大兴安岭', '东营', '德州', '德阳', '达州', '德宏', '大理', '迪庆', '定西', '敦煌', '丹阳', '东台', '大丰',
            '德清', '东阳', '当阳', '登封', '儋州', '东港', '东兴', '都江堰', '大石桥', '大冶', '东方', '大通', '灯塔', '调兵山', '邓州', '电白', '东平',
            '定州', '东海', '达拉特旗', '郸城', '大荔', '大洼', '大竹', '东光', '敦化', '大邑', '砀山', '道县', '大安市', '定安县', '东明县', '定陶区',
            '定边县'
        ]
    },
    {
        E: [
            '鄂尔多斯', '鄂州', '恩施', '峨眉山', '额尔古纳', '恩平', '额敏县'
        ]
    },
    {
        F: [
            '福州', '佛山', '抚顺', '阜新', '阜阳', '抚州', '防城港', '涪陵', '富阳', '福清', '凤凰', '肥城', '阜宁', '奉化', '汾阳', '阜康', '凤城',
            '范县', '丰城', '封丘', '肥乡', '繁昌', '富顺', '抚松', '丰县', '扶风', '扶沟', '丰宁', '佛冈', '费县', '凤台', '肥西县', '奉新', '方城',
            '富源县', '分宜', '扶绥县', '凤翔县', '福安', '福鼎市', '府谷县']
    },
    {
        G: [
            '广州', '桂林', '贵阳', '赣州', '广元', '广安', '贵港', '甘孜', '甘南', '固原', '巩义', '桂平', '高邮', '广饶', '高州', '个旧', '高碑店', '盖州', '公主岭', '高密',
            '广汉', '藁城', '高平', '格尔木', '古交', '灌云', '灌南', '赣榆', '共青城', '高安', '广德', '高陵', '高阳', '公安', '固始县', '光泽'
        ]
    },
    {
        H: [
            '杭州', '合肥', '葫芦岛', '海口', '哈尔滨', '邯郸', '呼和浩特', '衡水', '呼伦贝尔', '鹤岗', '湖州', '黑河', '淮安', '黄山', '淮南', '淮北', '鹤壁', '菏泽', '黄石',
            '怀化', '惠州', '河源', '黄冈', '衡阳', '贺州', '河池', '红河', '海东', '海西', '海南州', '汉中', '花都', '哈密', '海宁', '惠阳', '惠东', '黄岛', '鹤山',
            '桦甸', '海城', '华阴', '霸州', '海阳', '海门', '海安', '侯马', '河津', '海林', '化州', '黄骅', '霍州', '淮阳', '合川', '海盐', '滑县', '惠安', '怀仁', '辉县',
            '户县', '和县', '含山', '汉阴', '河口', '辉南', '洪洞', '横店', '华亭', '韩城', '洪湖', '怀宁', '珲春', '霍邱', '海沧', '潢川县', '衡阳县', '衡山县', '衡东县', '贺兰县',
            '海伦市', '汉南区', '合江县', '怀远县', '会泽县', '河间市', '合浦县', '环县', '黄陵县', '华容'
        ]
    },
    {
        I: []
    },
    {
        J: [
            '锦州', '济南', '焦作', '九江', '晋城', '晋中', '鸡西', '佳木斯', '吉林', '嘉兴', '金华', '吉安', '景德镇', '济宁', '荆门', '济源', '江门', '荆州', '揭阳', '酒泉',
            '金昌', '嘉峪关', '江阴', '靖江', '晋江',
            '金坛', '江山', '嘉善', '晋州', '句容', '建湖', '介休', '胶州', '建德', '简阳', '集安', '即墨', '建阳', '蛟河', '监利', '郏县', '巨野', '江津', '金湖', '江都', '莒南', '江油', '京山',
            '缙云', '金乡', '嘉祥', '金沙', '泾县', '集美', '鄄城县', '靖边', '江川县', '江华瑶族自治县', '吉安县', '吉水县', '晋宁县', '江永', '建水县', '嘉鱼县', '祁县', '精河县', '靖西县'
        ]
    },
    {
        K: [
            '昆明', '开封', '昆山', '喀什地区', '克拉玛依', '开平', '库尔勒', '奎屯', '开州区', '垦利', '宽城', '开阳', '开化'
        ]
    },
    {
        L: [
            '廊坊', '临汾', '吕梁', '辽阳', '辽源', '连云港', '六安', '丽水', '龙岩', '洛阳', '聊城', '临沂', '莱芜', '漯河', '娄底', '泸州', '乐山',
            '柳州', '来宾', '临沧', '拉萨', '六盘水', '凉山', '丽江', '临夏', '陇南', '兰州', '兰溪', '临海', '溧阳', '耒阳', '龙口', '陆丰', '莱阳',
            '乐昌', '莱州', '临安', '临清', '乐陵', '龙海', '醴陵', '浏阳', '莱西', '廉江', '阆中','乐平', '灵宝', '冷水江', '连州', '灵山', '滦南', '临江',
            '陵水', '鹿泉', '利川', '凌海', '老河口', '滦县', '乐亭', '临朐', '栾城', '连江', '隆昌', '林州', '临潼', '蓝田', '临漳', '灵石', '鲁山',
            '临猗', '柳河', '鹿邑', '临沭', '兰陵', '龙游', '栾川', '雷州', '隆尧', '陵川', '龙泉', '临邑', '利津', '梁山', '澧县', '辽中', '涟水',
            '临澧', '兰考县', '灵丘县', '利辛', '洛川县', '泸县','溧水区', '禄丰县', '罗平县', '涟源市', '庐江县', '隆回', '临颍', '蓝山', '隆化县', '洛宁', '芦溪',
            '卢氏县', '罗定市', '乐东', '梁平', '临高县', '罗源县']
    },
    {
        M: [
            '牡丹江', '马鞍山', '茂名', '梅州', '绵阳', '眉山', '密山', '漠河', '满洲里', '明光', '梅河口', '孟州', '麻城', '渑池', '眉县', '民权', '孟津', '牟平', '蒙阴',
            '绵竹', '蒙自市', '蒙城', '明水县', '米易县', '闽侯县', '勐腊县'
        ]
    },
    {
        N: [
            '宁波', '南京', '南昌', '南通', '南宁', '宁德', '南平', '南阳', '内江', '南充', '怒江', '南沙', '宁海', '宁乡', '南安', '南雄', '讷河', '南乐', '宁津', '宁晋', '南陵',
            '宁国', '宁阳', '内丘', '南和', '内黄', '宁陵', '南部县', '南皮县', '宁远县', '嫩江县'
        ]
    },
    {
        O: []
    },
    {
        P: [
            '盘锦', '莆田', '萍乡', '平顶山', '濮阳', '攀枝花', '普洱', '平凉', '邳州', '普宁', '平湖', '平度', '彭州', '蓬莱', '鄱阳', '磐石', '浦江', '平潭', '平原', '平山', '濮阳县',
            '沛县', '蒲城', '盘县', '平江', '平邑', '平遥', '平果', '平阳', '平舆', '平罗县', '平阴县', '平昌县'
        ]
    },
    {
        Q: [
            '青岛', '泉州', '齐齐哈尔', '秦皇岛', '七台河', '衢州', '清远', '钦州', '黔西南', '曲靖', '黔东南', '黔南', '庆阳', '迁安', '琼海', '曲阜', '启东', '青州',
            '潜江', '沁阳', '邛崃', '清丰', '齐河', '淇县', '全椒', '清河', '青田', '栖霞', '青县', '潜山', '庆云', '祁东县', '杞县', '庆安县', '青冈县', '岐山县', '青阳县'
        ]
    },
    {
        R: [
            '日照', '日喀则', '仁怀', '瑞安', '如皋', '荣成', '乳山', '汝州', '瑞金', '瑞昌', '仁寿', '任丘', '如东', '汝阳','容县', '汝城县', '荣昌区'
        ]
    },
    {
        S: [
            '上海', '深圳', '沈阳', '石家庄', '苏州', '三亚', '汕头', '朔州', '双鸭山', '四平', '松原', '绍兴', '宿迁', '绥化', '宿州', '上饶', '三明', '十堰',
            '商丘', '三门峡', '韶关', '汕尾', '随州', '邵阳', '遂宁', '石嘴山', '商洛', '石河子', '顺德', '石狮', '上虞', '寿光', '神农架', '韶山', '射阳', '沭阳', '嵊州',
            '三河', '沙河', '四会', '松滋', '舒兰', '邵东', '沙湾', '泗阳', '睢县', '石泉', '单县', '泗洪', '上高', '绥中', '神木', '涉县', '上蔡', '遂昌', '睢宁',
            '沈丘', '三门', '什邡', '上杭', '石岛', '泗水', '社旗', '商河', '射洪', '舒城', '嵩县', '石门', '桑植', '商城县', '鄯善县', '深州市', '泗县', '商水县', '上林县',
            '遂川', '上栗', '双峰', '肃宁县', '莎车县', '绥德县', '沙县', '深泽县', '石柱', '邵武', '寿县', '三台县'
        ]
    },
    {
        T: [
            '天津', '太原', '唐山', '通辽', '铁岭', '通化', '台州', '泰州', '铜陵', '泰安', '铜仁', '铜川', '天水', '塔城', '吐鲁番', '太仓', '桐乡', '台山', '腾冲', '滕州', '桐庐', '泰兴', '天长',
            '天门', '桐城', '洮南', '台前', '太和', '汤阴', '藤县', '太谷', '天台', '土默特右旗', '铜梁', '郯城', '桃源', '同安', '通许县', '通榆县', '通海县', '唐河', '泰和县', '太康县', '铜鼓',
            '田东县', '通江县'
        ]
    },
    {
        U: []
    },
    {
        V: []
    },
    {
        W: [
            '无锡', '武汉', '芜湖', '温州', '乌海', '乌兰察布', '威海', '潍坊', '梧州', '文山', '渭南', '武威', '乌鲁木齐', '吴忠', '武夷山', '吴江', '万州', '婺源', '温岭', '武安',
            '文登', '乌镇', '吴川', '文昌', '舞钢', '万宁', '温县', '武陟', '武穴', '乌苏', '卫辉', '芜湖县', '无为', '乌拉特前旗', '围场', '武城', '汶上', '微山', '无极', '万荣',
            '舞阳', '威宁', '武鸣', '武义', '瓦房店', '尉氏县', '武隆县', '万载', '武平县', '威县', '武冈市', '望奎县', '五常市', '旺苍县'
        ]
    },
    {
        X: [
            '西安', '厦门', '新乡', '徐州', '邢台', '忻州', '兴安盟', '锡林郭勒', '宣城', '新余', '襄阳', '信阳', '许昌', '湘西', '咸宁', '孝感', '湘潭', '西双版纳', '西宁', '咸阳', '仙桃', '香格里拉', '新沂',
            '新密', '荥阳', '新郑', '兴宁', '西塘', '新民', '兴化', '湘阴', '新泰', '响水', '辛集', '湘乡', '项城', '孝义', '修武', '象山', '兴城', '兴平', '仙居', '夏津', '信宜', '新化', '新安', '新乡县', '宣威',
            '霞浦', '襄垣', '西平', '新乐', '西乡', '徐闻', '夏邑', '浚县', '盱眙', '香河', '信丰', '浠水', '西华', '薛城', '新昌', '淅川', '溆浦', '新蔡', '秀山土家族苗族自治县', '新洲区', '仙游县',
            '新野', '兴国县', '新田', '新干', '祥云县', '寻乌县', '襄城县', '新宁', '献县', '新津县', '旬阳县'
        ]
    },
    {
        Y: [
            '烟台', '扬州', '阳泉', '运城', '营口', '延边', '伊春', '盐城', '鹰潭', '宜春', '宜昌', '永州', '阳江', '岳阳', '益阳', '宜宾', '雅安', '云浮', '玉林', '玉溪', '银川', '延安', '榆林', '义乌', '伊犁', '乐清', '阳朔', '余姚', '永康',
            '宜兴', '兖州', '扬中', '伊川', '英德', '仪征', '偃师', '禹城', '禹州', '伊宁', '宜城', '原平', '永城', '永济', '玉环', '宜都', '沅江', '永年', '永川', '阎良', '原阳', '易县', '宜阳', '叶县', '阳城', '云阳', '郓城', '玉山', '阳谷',
            '虞城', '于都', '沂水', '沂南', ' 杨凌', '伊金霍洛旗', '攸县', '永顺县', '永兴县', '酉阳土家族苗族自治县', '应县', '宜丰', '营山县', '永安', '永丰', '鄢陵', '永新', '宜良县', '阳山县', '榆树市', '沅陵县', '永登县', '鱼台县', '宜州市',
            '义马市', '盂县', '永嘉县'
        ]
    },
    {
        Z: [
            '郑州', '淄博', '珠海', '中山', '张家口', '舟山', '镇江', '枣庄', '漳州', '驻马店', '周口', '湛江', '肇庆', '株洲', '张家界', '资阳', '自贡', '遵义', '昭通', '张掖', '中卫', '涿州', '张家港', '增城', '诸暨', '章丘', '邹平', '枣阳',
            '庄河', '诸城', '钟祥', '招远', '遵化', '枝江', '樟树', '漳浦', '正定', '中牟', '准格尔旗', '柘城', '邹城', '赵县', '织金', '芷江', '周至', '资兴市', '扎兰屯市', '漳平', '忠县', ' 柘荣', '中江县'
        ]
    }
]